<?php
// В змінній $year збігається рік. Визначте чи є він високосним.
// Рік буде високосним в двох випадках: або він ділиться на 4, але при цьому не ділиться на 100,
// або ділиться на 400.

echo ((isLeap(2009)) ? 'високосний' : 'не високосний') . "<br>";
echo ((isLeap(2012)) ? 'високосний' : 'не високосний') . "<br>";
echo ((isLeap(2100)) ? 'високосний' : 'не високосний') . "<br>";

function isLeap($year)
{
    return (($year % 4 == 0 && $year % 100 != 0) || ($year % 400 == 0))
        ? true
        : false;
}



